pyocd/pyOCD/pyocd/debug/svd/data/HC32F155.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART2</name>
            <description>desc USART</description>
            <baseAddress>0x40001C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART3</name>
            <description>desc USART</description>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART4</name>
            <description>desc USART</description>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART5</name>
            <description>desc USART</description>
            <baseAddress>0x40002800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART6</name>
            <description>desc USART</description>
            <baseAddress>0x40002C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
    </peripherals>
</device>
